# DS-SF-34 | 02 | The `pandas` Library | Assignment | Starter Code

## The Bistro Meets `pandas`

You've just told one of your friend that you are taking a Data Science class.  (Yeah!)  Your friend is running a bistro, a small restaurant, serving moderately priced simple meals in a modest setting ([Wikipedia](https://en.wikipedia.org/wiki/Bistro)).  She collected over some period of time the following information of her patrons' visits.

| Variable's name | Its meaning |
|:---:|:---|
| `name` | Patron's first name |
| `gender` | Patron's gender |
| `is_smoker` | Whether the patron is smoking or not |
| `party` | Party's size |
| `check` | Check amount (\$) (after taxes but before tips) |
| `tip` | Tip (\$) that the patron added to the check |
| `day` | Week day of the visit |
| `time` | Rough time estimate of the visit |

In this assignment, we will be exploring this dataset using `pandas`.<sup>(*)</sup>

<sup>(*)</sup> this dataset was adapted from the `tips` dataset of the `seaborn` package (https://github.com/mwaskom/seaborn-data)

> ### Question 1.  Import `numpy` (as `np`) and `pandas` (as `pd`).

In [1]:
import os

# TODO
import numpy as np
import pandas as pd

pd.set_option('display.max_rows', 10)
pd.set_option('display.notebook_repr_html', True)
pd.set_option('display.max_columns', 10)

> ### Question 2.  Read the `dataset-02-tips.csv` dataset.

In [4]:
# TODO

df = pd.read_csv("../datasets/dataset-02-bistro.csv")

> ### Question 3.  What is the class of the `pandas` object storing the dataset?

In [5]:
# TODO

type(df)

pandas.core.frame.DataFrame

Answer: TODO

> ### Question 4.  How many samples (i.e., rows) are in this dataset?

In [7]:
# TODO

df.shape

#244 rows

(244, 8)

Answer: TODO

> ### Question 5.  How many variables (i.e., columns) are in this dataset?

In [8]:
# TODO

df.head()

#8 columns

      day    time      name  gender  is_smoker  party  check   tip
0  Sunday  Dinner  Kimberly  Female      False      2  16.99  1.01
1  Sunday  Dinner  Nicholas    Male      False      3  10.34  1.66
2  Sunday  Dinner     Larry    Male      False      3  21.01  3.50
3  Sunday  Dinner    Joseph    Male      False      2  23.68  3.31
4  Sunday  Dinner    Janice  Female      False      4  24.59  3.61

Answer: TODO

> ### Question 6.  Print the name of each column in the dataset, one name per line.

In [12]:
# TODO

for column in df.columns:
    print column

day
time
name
gender
is_smoker
party
check
tip

> ### Question 7.  Print the first two rows of the dataset to the console.  What does the output look like?

In [13]:
# TODO

df.head(2)

      day    time      name  gender  is_smoker  party  check   tip
0  Sunday  Dinner  Kimberly  Female      False      2  16.99  1.01
1  Sunday  Dinner  Nicholas    Male      False      3  10.34  1.66

Answer: TODO

> ### Question 8.  Extract the last 2 rows of the data frame and print them to the console.  What does the output look like?

In [14]:
# TODO

df.tail(2)

          day    time    name  gender  is_smoker  party  check   tip
242  Saturday  Dinner     Jon    Male      False      2  17.82  1.75
243  Thursday  Dinner  Brandi  Female      False      2  18.78  3.00

Answer: TODO

> ### Question 9.  Does the dataset contain any missing values?

In [16]:
# TODO

df.isnull().sum().sum()

0L

Answer: TODO

> ### Question 10.  What can you say about the `is_smoker` variable?  I.e., will it bring any insights when analyzing the dataset?  What do you want to do with it?  (and do it...)

In [27]:
# TODO

df['is_smoker'].dtype

total_rows = len(df['is_smoker'])
smokers = len(df[df['is_smoker'] == True])
smokers

0

In [25]:
df['is_smoker']

0      False
1      False
2      False
3      False
4      False
       ...
239    False
240    False
241    False
242    False
243    False
Name: is_smoker, Length: 244, dtype: bool

In [28]:
df = df.drop('is_smoker',1)

In [29]:
df.head()

      day    time      name  gender  party  check   tip
0  Sunday  Dinner  Kimberly  Female      2  16.99  1.01
1  Sunday  Dinner  Nicholas    Male      3  10.34  1.66
2  Sunday  Dinner     Larry    Male      3  21.01  3.50
3  Sunday  Dinner    Joseph    Male      2  23.68  3.31
4  Sunday  Dinner    Janice  Female      4  24.59  3.61

Answer: TODO

> ### Question 11.  For which week days does the dataset has data for?

In [30]:
# TODO

df['day'].unique()

array(['Sunday', 'Saturday', 'Thursday', 'Friday'], dtype=object)

Answer: TODO

> ### Question 12.  How often was the bistro patronized for each week day?

(check `.value_counts()`; it could come in handy)

(http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.value_counts.html)

In [49]:
# TODO

df['day'].value_counts().to_frame()

          day
Saturday   87
Sunday     76
Thursday   62
Friday     19

Answer: TODO

> ### Question 13.  How much tip did waiters collect for each week day?

In [32]:
df.head()

      day    time      name  gender  party  check   tip
0  Sunday  Dinner  Kimberly  Female      2  16.99  1.01
1  Sunday  Dinner  Nicholas    Male      3  10.34  1.66
2  Sunday  Dinner     Larry    Male      3  21.01  3.50
3  Sunday  Dinner    Joseph    Male      2  23.68  3.31
4  Sunday  Dinner    Janice  Female      4  24.59  3.61

In [46]:
# TODO
df.groupby(['day']).sum()['tip'].to_frame()

#.to_frame --> will change a series to a data frame

             tip
day
Friday     51.96
Saturday  260.40
Sunday    247.39
Thursday  171.83

Answer: TODO

> ### Question 14.  What is the average tip per check (in absolute \$) for each week day?

In [55]:
# TODO
daily_visits = df['day'].value_counts()
daily_visits_df = pd.DataFrame({'day': daily_visits.index, 'visits': daily_visits.values})
daily_visits_df

daily_tip_total = df.groupby(['day']).sum()['tip']
daily_tip_total_df = pd.DataFrame({'day': daily_tip_total.index, 'tip total': daily_tip_total.values})
daily_tip_total_df

merged_df = daily_visits_df.merge(daily_tip_total_df)
merged_df

merged_df['average tip'] = merged_df['tip total'] / merged_df['visits']
merged_df

        day  visits  tip total  average tip
0  Saturday      87     260.40     2.993103
1    Sunday      76     247.39     3.255132
2  Thursday      62     171.83     2.771452
3    Friday      19      51.96     2.734737

Answer: TODO

> ### Question 15.  What is the average tip per check (as a percentage of the check) for each week day?

In [59]:
# TODO

daily_check_total = df.groupby(['day']).sum()['check']
daily_check_total_df = pd.DataFrame({'day': daily_check_total.index, 'check total': daily_check_total.values})
daily_check_total_df

merged_df = merged_df.merge(daily_check_total_df)
merged_df

        day  visits  tip total  average tip  check total
0  Saturday      87     260.40     2.993103      1778.40
1    Sunday      76     247.39     3.255132      1627.16
2  Thursday      62     171.83     2.771452      1096.33
3    Friday      19      51.96     2.734737       325.88

In [61]:
merged_df['avg tip per check'] = merged_df['tip total'] / merged_df['check total']
merged_df

        day  visits  tip total  average tip  check total  avg tip per check
0  Saturday      87     260.40     2.993103      1778.40           0.146424
1    Sunday      76     247.39     3.255132      1627.16           0.152038
2  Thursday      62     171.83     2.771452      1096.33           0.156732
3    Friday      19      51.96     2.734737       325.88           0.159445

Answer: TODO

> ### Question 16.  Are there any name in common between male and female patrons?  (E.g., `Chris` can refer to either a man or a woman)

(check `numpy.intersect1d()`; it could come in handy)

(https://docs.scipy.org/doc/numpy/reference/generated/numpy.intersect1d.html)

In [62]:
# TODO

df.head()

      day    time      name  gender  party  check   tip
0  Sunday  Dinner  Kimberly  Female      2  16.99  1.01
1  Sunday  Dinner  Nicholas    Male      3  10.34  1.66
2  Sunday  Dinner     Larry    Male      3  21.01  3.50
3  Sunday  Dinner    Joseph    Male      2  23.68  3.31
4  Sunday  Dinner    Janice  Female      4  24.59  3.61

In [69]:
female_guests = df[df['gender'] == 'Female']
female_guests

male_guests = df[df['gender'] == 'Male']
male_guests

np.intersect1d(male_guests['name'],female_guests['name'])

array(['Casey'], dtype=object)

Answer: TODO

> ### Question 17.  If no patrons share the same name, how many unique patrons are in the dataset?

In [70]:
# TODO
df['name'].unique()

array(['Kimberly', 'Nicholas', 'Larry', 'Joseph', 'Janice', 'Mark',
       'Jamie', 'Steven', 'Wilburn', 'Ian', 'Rick', 'Katie', 'Karl',
       'Timothy', 'Anne', 'Brandon', 'Alice', 'Roman', 'Paisley', 'Sean',
       'William', 'Pauline', 'Jo', 'Richard', 'Carl', 'Mario', 'Charles',
       'Tyler', 'Jonathan', 'Jan', 'Dustin', 'Reyes', 'Jessica', 'Laura',
       'Alejandro', 'Levi', 'Leonard', 'Lori', 'Casey', 'Gregory', 'James',
       'Arturo', 'Maurice', 'Melvin', 'David', 'Chandler', 'Frank',
       'Harold', 'Keith', 'Jennie', 'Wanda', 'Brian', 'Christopher',
       'Marvin', 'Destiny', 'Jerry', 'Diego', 'Bryson', 'Matt', 'Daniel',
       'Harry', 'Rebecka', 'Bailey', 'Ronald', 'Jocelyn', 'Victoria',
       'Lisa', 'Miriam', 'Andrew', 'Edwin', 'Erick', 'Anna', 'Kaleb',
       'Donna', 'Brent', 'Kenneth', 'Todd', 'Maverick', 'Brandi',
       'Melinda', 'Eleanor', 'Curtis', 'Kevin', 'Alex', 'Roger',
       'Adalberto', 'Martha', 'Dora', 'Mildred', 'Tracy', 'Dena', 'Kody',
       'Kelly', 'Theresa', 'Javier', 'Ruth', 'Michal', 'Erin', 'Raelynn',
       'Imani', 'Stanley', 'Lena', 'Shaquasia', 'Mary', 'Norman', 'Karen',
       'Walter', 'Elizabeth', 'Marian', 'Enrique', 'Lewis', 'Jaycee',
       'Brenda', 'Lillyanna', 'Lauren', 'Margaret', 'Martin', 'Jean',
       'Shirlene', 'Shelley', 'Phyllis', 'Barbara', 'Susan', 'Neil',
       'Zackary', 'Christian', 'Cisco', 'Leslie', 'Carter', 'Robert',
       'Jacqueline', 'Benjamin', 'Jeffery', 'Melody', 'Scott', 'Vickie',
       'Sam', 'Aiden', 'Cassandra', 'Antonio', 'Ricky', 'Gerald',
       'Maryann', 'Amos', 'Claude', 'Logan', 'Dennis', 'Torrey',
       'Leonardo', 'Kelley', 'Francis', 'Jacob', 'Connie', 'Dale', 'Paul',
       'John', 'Diana', 'Angeline', 'Hasini', 'Celeste', 'Alexander',
       'Shirley', 'Willie', 'Matthew', 'Dominic', 'Natalie', 'Fred',
       'Roberta', 'Luis', 'Sarah', 'Eduardo', 'Paulette', 'Vernon',
       'Donald', 'Jon', 'Alfred', 'Darwin', 'Henry', 'Jeremy', 'Dorothy',
       'Sandra'], dtype=object)

In [71]:
len(df['name'].unique())

181

Answer: TODO

> ### Question 18.  How many times did `Kevin` patronized the bistro?  How about `Alice`?

In [76]:
# TODO

Kevin_visits = df[df['name'] == 'Kevin']
Kevin_visits

len(Kevin_visits)

Alice_visits = df[df['name'] =='Alice']
len(Alice_visits)

2

Answer: TODO

> ### Question 19.  Who are the top 3 female and male patrons?

In [77]:
# TODO

female_guests

          day    time      name  gender  party  check   tip
0      Sunday  Dinner  Kimberly  Female      2  16.99  1.01
4      Sunday  Dinner    Janice  Female      4  24.59  3.61
11     Sunday  Dinner     Katie  Female      4  35.26  5.00
14     Sunday  Dinner      Anne  Female      2  14.83  3.02
16     Sunday  Dinner     Alice  Female      3  10.33  1.67
..        ...     ...       ...     ...    ...    ...   ...
226    Friday   Lunch      Mary  Female      2  10.09  2.00
229  Saturday  Dinner     Casey  Female      2  22.12  2.88
238  Saturday  Dinner   Dorothy  Female      3  35.83  4.67
240  Saturday  Dinner    Sandra  Female      2  27.18  2.00
243  Thursday  Dinner    Brandi  Female      2  18.78  3.00

[87 rows x 7 columns]

In [87]:
female_guests_names = female_guests.groupby(['name']).sum()['check']
female_guests_names

female_guests_names_df = pd.DataFrame({'name': female_guests_names.index, 'check': female_guests_names.values})
female_guests_names_df

female_guests_names_df.sort_values(by = ['check'], ascending= False).head(3)

    check   name
36  63.95  Laura
45  55.26   Mary
40  55.08   Lisa

In [88]:
male_guests_names = male_guests.groupby(['name']).sum()['check']
male_guests_names

male_guests_names_df = pd.DataFrame({'name': male_guests_names.index, 'check': male_guests_names.values})
male_guests_names_df

male_guests_names_df.sort_values(by = ['check'], ascending= False).head(3)

     check   name
28  171.30  David
17  125.98  Casey
48   98.89  James

Answer: TODO

> ### Question 20.  Who's the best tipper (as a fraction of all tips over all check totals)?  Who's the worst?  How many times did they patronize the bistro?

(check `numpy.intersect1d()`; it could come in handy)

- (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.DataFrame.sort_values.html)
- (http://pandas.pydata.org/pandas-docs/stable/generated/pandas.Series.sort_values.html)

In [89]:
# TODO

male_guests

          day    time      name gender  party  check   tip
1      Sunday  Dinner  Nicholas   Male      3  10.34  1.66
2      Sunday  Dinner     Larry   Male      3  21.01  3.50
3      Sunday  Dinner    Joseph   Male      2  23.68  3.31
5      Sunday  Dinner      Mark   Male      4  25.29  4.71
6      Sunday  Dinner     Jamie   Male      2   8.77  2.00
..        ...     ...       ...    ...    ...    ...   ...
236  Saturday  Dinner     Henry   Male      2  12.60  1.00
237  Saturday  Dinner    Jeremy   Male      2  32.83  1.17
239  Saturday  Dinner     Kevin   Male      3  29.03  5.92
241  Saturday  Dinner      Carl   Male      2  22.67  2.00
242  Saturday  Dinner       Jon   Male      2  17.82  1.75

[157 rows x 7 columns]

In [96]:
male_guests_tips = male_guests.groupby(['name']).sum()['tip']
male_guests_tips_df = pd.DataFrame({'name': male_guests_tips.index, 'tip': male_guests_tips.values})
male_guests_tips_df

          name   tip
0    Adalberto  1.50
1        Aiden  2.24
2    Alejandro  6.45
3         Alex  2.98
4    Alexander  4.00
..         ...   ...
105     Walter  2.50
106    Wilburn  1.96
107    William  6.05
108     Willie  2.00
109    Zackary  2.00

[110 rows x 2 columns]

In [98]:
male_guests_names_df = male_guests_names_df.merge(male_guests_tips_df)
male_guests_names_df

     check       name   tip
0    12.46  Adalberto  1.50
1    20.76      Aiden  2.24
2    49.63  Alejandro  6.45
3    20.55       Alex  2.98
4    20.53  Alexander  4.00
..     ...        ...   ...
105  14.26     Walter  2.50
106  15.04    Wilburn  1.96
107  29.94    William  6.05
108  30.06     Willie  2.00
109   7.51    Zackary  2.00

[110 rows x 3 columns]

Answer: TODO

In [99]:
df

          day    time      name  gender  party  check   tip
0      Sunday  Dinner  Kimberly  Female      2  16.99  1.01
1      Sunday  Dinner  Nicholas    Male      3  10.34  1.66
2      Sunday  Dinner     Larry    Male      3  21.01  3.50
3      Sunday  Dinner    Joseph    Male      2  23.68  3.31
4      Sunday  Dinner    Janice  Female      4  24.59  3.61
..        ...     ...       ...     ...    ...    ...   ...
239  Saturday  Dinner     Kevin    Male      3  29.03  5.92
240  Saturday  Dinner    Sandra  Female      2  27.18  2.00
241  Saturday  Dinner      Carl    Male      2  22.67  2.00
242  Saturday  Dinner       Jon    Male      2  17.82  1.75
243  Thursday  Dinner    Brandi  Female      2  18.78  3.00

[244 rows x 7 columns]

In [145]:
#restart question

group_by_name = df.groupby(['name']).sum()
check_totals = group_by_name['check'].to_frame()
check_totals
check_totals['tip'] = group_by_name['tip']
check_totals

check_totals['tip percentage'] = check_totals['tip'] / check_totals['check']
check_totals

check_totals.sort_values(by = ['tip percentage'], ascending = False)

check_totals['name'] = check_totals.index

In [148]:
people_visits = df.groupby(['name']).size()
people_visits_df = pd.DataFrame({'name': people_visits.index, 'visits': people_visits.values})

check_totals = check_totals.merge(people_visits_df)
check_totals

     check   tip  tip percentage       name  visits
0    12.46  1.50        0.120385  Adalberto       1
1    20.76  2.24        0.107900      Aiden       1
2    49.63  6.45        0.129962  Alejandro       2
3    20.55  2.98        0.145012       Alex       2
4    20.53  4.00        0.194837  Alexander       1
..     ...   ...             ...        ...     ...
176  34.81  5.20        0.149382      Wanda       1
177  15.04  1.96        0.130319    Wilburn       1
178  29.94  6.05        0.202071    William       2
179  30.06  2.00        0.066534     Willie       1
180   7.51  2.00        0.266312    Zackary       1

[181 rows x 5 columns]